Estrallas/STM32-RC522------Nake-/stm32代码/User/Device/oled_device.h
/**
  * @file       oled_device.h
  * @author     拉咯比哩
  * @version    V1.0.1
  * @date       20260326
  * @brief      OLED 驱动，基于 STM32 HAL 库
  * 
  * <h2><center>&copy;此文件版权归【拉咯比哩】所有.</center></h2>
  */

#ifndef _OLED_DEVICE_H_
#define _OLED_DEVICE_H_

#include "project_config.h"
#include "stm32f1xx_hal.h"


/// @brief          设备号枚举
///
/// @note 
typedef enum
{
    emOledDevNum0           = 0,
    emOledDevNum1,               // emOledDevNum1 = 1,
}
emOledDevNumTdf;



/// @brief      字号枚举定义
///
/// @note
typedef enum
{
    emOledFontSize_6x12     = 12,                       // 12 字符大小 6x12
    emOledFontSize_8x16     = 16,                       // 16 字符大小 8x16 
    emOledFontSize_12x24    = 24,                       // 24 字符大小 12x24
}
emOledFontSizeTdf;

/// @brief      像素显示模式枚举定义
///
/// @note
typedef enum
{
    emOledPixelShowMode_Positive    = 0,                // 0  正色
    emOledPixelShowMode_Negative    = 1,                // 1  反色
}
emOledPixelShowModeTdf;

/// @brief          静态参数定义
///
/// @note           
typedef struct
{
    I2C_HandleTypeDef   *pstI2cHandle;                  // I2C 句柄指针
    uint16_t            usDevAddr;                      // 设备地址，需左移 1 位，如 0x3C -> 0x78
}
stOledStaticParamTdf;

/// @brief          运行参数定义
///
/// @note           
typedef struct
{
    uint8_t             aucOledBuffer[OLED_BUFFER_WIDTH * OLED_BUFFER_HEIGHT];        // 显存
}
stOledRunningParamTdf;

/// @brief          结构参数定义
///
/// @note           
typedef struct
{
    stOledStaticParamTdf     stStaticParam;  // 静态参数
    stOledRunningParamTdf    stRunningParam; // 运行参数
}
stOledDeviceParamTdf;

void vOledWriteOneCharToBuffer(uint32_t x, uint32_t y, uint8_t ucChar, emOledFontSizeTdf emFontSize, emOledPixelShowModeTdf emMode, emOledDevNumTdf emDevNum);
void vUiWriteStringToBuffer(uint16_t x, uint16_t y, const uint8_t *c_pucChar, emOledFontSizeTdf emFontSize, emOledPixelShowModeTdf emMode, emOledDevNumTdf emDevNum);
void vOledDrawOnePointToBuffer(uint32_t x, uint32_t y, emOledDevNumTdf emDevNum);
void vOledClearOnePointToBuffer(uint32_t x, uint32_t y, emOledDevNumTdf emDevNum);
void vOledRefreshFromBuffer(emOledDevNumTdf emDevNum);
void vOledDeviceInit(stOledStaticParamTdf *pstInit, emOledDevNumTdf emDevNum);

#endif
